app/views/devices/index.html.haml

SELECT "borrows".* FROM "borrows" WHERE (user_id= 1 and date( givebacktime) = date('1990-01-01') )
---
    - @remind.each do |r|
      - if  r.ordertime.to_i- r.borrowtime.to_i >24*60*60

SELECT "devices".* FROM "devices" WHERE (statement = '可用')
---
        - elsif r.ordertime.to_i-Time.now.to_i  <= 60*60
          %p.notice="还有不足 #{(r.ordertime.to_i-Time.now.to_i)/60} 分钟就要归还编号为 #{r.device_id} 的设备！"