app/controllers/admins_controller.rb

  def edit
    @admin = Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @admin = Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @admin = Admin.new(admin_params)
    @admin.save
---
INSERT INTO "admins" ("name", "passwd", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "admin"], ["passwd", "admin"], ["created_at", "2016-01-13 06:10:00.616949"], ["updated_at", "2016-01-13 06:10:00.616949"]]

  def show
    @admin = Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 1]]

  def checklogin
    @admin = Admin.where("name = ? and passwd = ?",  params[:name][:name],params[:passwd][:passwd]).take
---
SELECT  "admins".* FROM "admins" WHERE (name = 'admin' and passwd = 'admin') LIMIT 1