app/controllers/borrows_controller.rb

SELECT  "devices".* FROM "devices" WHERE "devices"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    if session[:user_id] == nil and session[:user_name] == nil
      redirect_to "/login"
    end
    @device = Device.find(params[:id])

SELECT  "devices".* FROM "devices" WHERE "devices"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "borrows" ("device_id", "borrowtime", "givebacktime", "ordertime", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "devices" SET "statement" = ?, "updated_at" = ? WHERE "devices"."id" = ?  [["statement", "借出"], ["updated_at", "2016-01-13 06:12:36.568320"], ["id", 1]]
---
  def borrow
    otime = Time.utc(params[:borrow].values[0],params[:borrow].values[1],params[:borrow].values[2],params[:borrow].values[3],params[:borrow].values[4])
    if otime.to_i-Time.now.to_i < 5*60
      flash[:warning] = "借出时间不得少于 5 分钟！"
      redirect_to "/devices"
    else
      @device = Device.find(session[:device_id])
      @borrow = Borrow.new

      @borrow.device_id = session[:device_id]
      @borrow.borrowtime = Time.now
      @borrow.givebacktime = "1990-01-01"
      @borrow.ordertime = otime
      @borrow.user_id = session[:user_id]

      @borrow.save
      @device.update(statement: "借出")

SELECT  "borrows".* FROM "borrows" WHERE (user_id= 1 and date(givebacktime) = date('1990-01-01') and device_id = '1') LIMIT 1
UPDATE "borrows" SET "givebacktime" = ?, "updated_at" = ? WHERE "borrows"."id" = ?  [["givebacktime", "2016-01-13 06:13:50.643269"], ["updated_at", "2016-01-13 06:13:50.644049"], ["id", 1]]
UPDATE "devices" SET "statement" = ?, "updated_at" = ? WHERE "devices"."id" = ?  [["statement", "可用"], ["updated_at", "2016-01-13 06:13:50.663012"], ["id", 1]]
SELECT  "devices".* FROM "devices" WHERE "devices"."id" = ? LIMIT 1  [["id", 1]]
---
  def giveback

    @borrow = Borrow.where("user_id= ? and date(givebacktime) = date('1990-01-01') and device_id = ?",session[:user_id],params[:id]).take
    if @borrow == nil or @borrow == ""  or (session[:user_id] == nil and session[:user_name] == nil)
      redirect_to "/login"
    else
      @borrow.givebacktime = Time.now
      @borrow.save

      @device = Device.find(params[:id])

SELECT "borrows".* FROM "borrows"
---
  def management
    if session[:admin_id] == nil and session[:admin_name] == nil
      redirect_to "/managerlogin"
    end
    @borrows = Borrow.all

SELECT "devices".* FROM "devices" WHERE (name like '%计算%' or department like '%计算%')
---
  def search
    session[:q] = params[:borrow][:q]
    @devices = Device.where("name like ? or department like ?" ,"%"+params[:borrow][:q]+"%" , "%"+params[:borrow][:q]+"%")