app/controllers/devices_controller.rb

SELECT "devices".* FROM "devices" WHERE (statement = '可用')
SELECT "borrows".* FROM "borrows" WHERE (user_id= 1 and date( givebacktime) = date('1990-01-01') )
SELECT "devices".* FROM "devices" WHERE "devices"."id" IN (1, 3)
---
  def index
    if session[:user_id] == nil and session[:user_name] == nil
      redirect_to "/login"
    end
    if Device.kindcollection.include?  params[:k]
      @devices = Device.where("kind = ?",params[:k])
    else
       @devices = Device.all
    end

    @myborrow= Array.new
    @remind=   Array.new
    @kinds=    Array.new
    i=0
    (Borrow.ungiveback session[:user_id]).each do |ugd|
      @myborrow[i]= ugd.device_id
      i+=1
    end
    @allborrow = Borrow.allungiveback

    @remind= (Borrow.ungiveback session[:user_id])
    @kinds= Device.kindcollection

    if params[:k] == "my"
      @devices = Device.find @myborrow

INSERT INTO "devices" ("name", "kind", "description", "department", "statement", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "计算机-1"], ["kind", "计算机"], ["description", "计算机"], ["department", "计算机系"], ["statement", "可用"], ["created_at", "2016-01-13 06:10:53.921345"], ["updated_at", "2016-01-13 06:10:53.921345"]]
---
  def create
    if session[:admin_id] == nil and session[:admin_name] == nil
      redirect_to "/managerlogin"
    end
    @device = Device.new(device_params)

    @device.save

SELECT  "devices".* FROM "devices" WHERE "devices"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if session[:admin_id] == nil and session[:admin_name] == nil and session[:user_id] == nil and session[:user_name] == nil
      redirect_to "/managerlogin"
    end
    @device = Device.find(params[:id])

SELECT "devices".* FROM "devices"
---
  def managedevices
    if session[:admin_id] == nil and session[:admin_name] == nil
      redirect_to "/managerlogin"
    end
    @devices = Device.all