app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if session[:admin_id] == nil and session[:admin_name] == nil
      redirect_to "/managerlogin"
    end
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    if session[:admin_id] == nil and session[:admin_name] == nil and session[:user_id] == nil and session[:user_name] == nil
      redirect_to "/"
    end
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    if session[:admin_id] == nil and session[:admin_name] == nil and session[:user_id] == nil and session[:user_name] == nil
      redirect_to "/managerlogin"
    end
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "passwd", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "user"], ["passwd", "user"], ["created_at", "2016-01-13 06:08:51.256581"], ["updated_at", "2016-01-13 06:08:51.256581"]]
---
  def createuser
    if (params[:passwd_confirm][:passwd_confirm].eql? params[:user][:passwd]) and  params[:user][:passwd] != "" and params[:user][:name] != "" and params[:user][:email] =~ /\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*/ and params[:user][:mobile] =~ /1(3|5|8)\d{9}/ and params[:user][:passwd].length >= 6

      @user = User.new(user_params)
      @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if session[:admin_id] == nil and session[:admin_name] == nil and session[:user_id] == nil and session[:user_name] == nil
      redirect_to "/managerlogin"
    else
      @user = User.find(params[:id])

SELECT "borrows".* FROM "borrows" WHERE (user_id = 1)
---
  def history
    if session[:user_id] == nil and session[:user_name] == nil
      redirect_to "/login"
    end
    @history = Borrow.where("user_id = ?",session[:user_id])

SELECT  "users".* FROM "users" WHERE (name = 'user' and passwd = 'user') LIMIT 1
---
  def checklogin

    @user = User.where("name = ? and passwd = ?",  params[:name][:name],params[:passwd][:passwd]).take